app/views/chats/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "user_chats" ON "users"."id" = "user_chats"."user_id" WHERE "user_chats"."chat_id" = ?  [["chat_id", 1]]
---
<h2>topic: <%= @chat.topic %></h2>
<% @chat.users.each do |user|  %>