app/controllers/chats_controller.rb

  def show
    @chat = Chat.find(params[:id])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @chat = Chat.find(params[:id])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]