app/controllers/comments_controller.rb

  def show
    #@user_comments = Comment.where(post_id: params["post_id"])
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @comment = Comment.create(comment_params)
    #if @comment.valid?
      @comment.save
---
INSERT INTO "comments" ("name", "post_id", "user_id", "created_at", "updated_at", "test") VALUES (?, ?, ?, ?, ?, ?)  [["name", "kjk"], ["post_id", 9], ["user_id", 72], ["created_at", "2019-05-08 11:14:43.128585"], ["updated_at", "2019-05-08 11:14:43.128585"], ["test", "jjj"]]
INSERT INTO "comments" ("name", "post_id", "user_id", "created_at", "updated_at", "test") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ddd"], ["post_id", 4], ["user_id", 52], ["created_at", "2019-05-08 09:12:27.541325"], ["updated_at", "2019-05-08 09:12:27.541325"], ["test", "ert"]]