app/controllers/posts_controller.rb

    def show
      @post = Post.find(params[:id])

      @comments = Comment.where(post_id: @post.id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 201], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]

    def new
      @post = Post.new
      @users= User.all
---
SELECT "users".* FROM "users"

    def create

      @post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "nn"], ["text", "nnnn"], ["user_id", 33], ["created_at", "2019-05-08 11:37:29.497015"], ["updated_at", "2019-05-08 11:37:29.497015"]]

    def update
      @post = Post.find_by_id(params[:id])
      @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "uuuu"], ["text", "dht"], ["updated_at", "2019-05-09 12:24:05.056792"], ["id", 338]]

     def destroy
       @post = Post.find_by_id(params[:id])
        @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 9]]