app/controllers/users_controller.rb

def create
  @user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ddd"], ["created_at", "2019-05-07 15:48:24.345712"], ["updated_at", "2019-05-07 15:48:24.345712"]]