app/models/user.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 133]]
---
  def post_count
    self.posts.length

SELECT "users".* FROM "users"
---
  def comment_count
    self.comment.length

SELECT "users".* FROM "users"
---
  def self.most_active_user
     most_active = User.all.max_by{|x|x.post_count}

SELECT "users".* FROM "users"
---
  def self.most_commented_user
    most_comment= User.all.max_by{|x|x.comment_count}